<a href="https://colab.research.google.com/github/smileone22/20Fall_BasicTools_for_BigData_Machine_Learning/blob/master/Pandas_Tuesday_master.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

In [4]:
data_frame = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/cities.csv')

In [5]:
data_frame

     LatD   "LatM"   "LatS"  "NS"  ...   "LonS"   "EW"              "City"  "State"
0      41        5       59   "N"  ...        0    "W"        "Youngstown"       OH
1      42       52       48   "N"  ...       23    "W"           "Yankton"       SD
2      46       35       59   "N"  ...       36    "W"            "Yakima"       WA
3      42       16       12   "N"  ...        0    "W"         "Worcester"       MA
4      43       37       48   "N"  ...       11    "W"   "Wisconsin Dells"       WI
..    ...      ...      ...   ...  ...      ...    ...                 ...      ...
123    39       31       12   "N"  ...       35    "W"              "Reno"       NV
124    50       25       11   "N"  ...        0    "W"            "Regina"       SA
125    40       10       48   "N"  ...       23    "W"         "Red Bluff"       CA
126    40       19       48   "N"  ...       48    "W"           "Reading"       PA
127    41        9       35   "N"  ...       23    "W"           "Ravenna"      OH

[128 rows x 10 columns]

In [6]:
df = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/biostats.csv',header=None, names=['Name','Sex','Age','Height','Weight'])

In [7]:
df

    Name         Sex     Age          Height           Weight
0   Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
1   Alex         "M"      41              74              170
2   Bert         "M"      42              68              166
3   Carl         "M"      32              70              155
4   Dave         "M"      39              72              167
5   Elly         "F"      30              66              124
6   Fran         "F"      33              66              115
7   Gwen         "F"      26              64              121
8   Hank         "M"      30              71              158
9   Ivan         "M"      53              72              175
10  Jake         "M"      32              69              143
11  Kate         "F"      47              69              139
12  Luke         "M"      34              72              163
13  Myra         "F"      23              62               98
14  Neil         "M"      36              75              160
15  Omar         "M"      38              70              145
16  Page         "F"      31              67              135
17  Quin         "M"      29              71              176
18  Ruth         "F"      28              65              131

In [8]:
df.head(3)

   Name         Sex     Age          Height           Weight
0  Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
1  Alex         "M"      41              74              170
2  Bert         "M"      42              68              166

In [9]:
# columns are called series 
type(df.Name)

pandas.core.series.Series

In [10]:
# group of columns are called DataFrame
type(df[:5])

pandas.core.frame.DataFrame

# using lists in python to create a dataframe in pandas

In [11]:
s1= pd.core.series.Series ([1,2,3])

In [12]:
s2= pd.core.series.Series (['one','two','three'])

In [13]:
pd.DataFrame( 
    data= dict(num=s1, word=s2)
    )

   num   word
0    1    one
1    2    two
2    3  three

In [14]:
df= pd.read_csv('https://cdn.wsform.com/wp-content/uploads/2020/09/currency.csv')

In [15]:
df

    Code Symbol                 Name
0    AFN     Af  Afghanistan Afghani
1    ALL    Lek          Albania Lek
2    ARS      $       Argentina Peso
3    AWG      ƒ        Aruba Guilder
4    AUD      $     Australia Dollar
..   ...    ...                  ...
109  UZS     лв       Uzbekistan Som
110  VEF     Bs    Venezuela Bolivar
111  VND      ₫        Viet Nam Dong
112  YER      ﷼           Yemen Rial
113  ZWD    NaN      Zimbabwe Dollar

[114 rows x 3 columns]

In [16]:
df.head(2)

  Code Symbol                 Name
0  AFN     Af  Afghanistan Afghani
1  ALL    Lek          Albania Lek

In [ ]:
# If read_csv for text file 
# df = pd.read_csv('blahblah/.txt', delimiter= '\t')

In [ ]:
# IF file does not have headers 
# df = pd.read_csv('blahblah/.txt',  header=None)
# Then set header names df.columns = ['name','age','job']
# ALL IN ONE:
# df = pd.read_csv('blahblah/.txt',  header=None, names= ['name','age','blah'])

In [17]:
friend_dict_list = [
    {'name':'John','age':30,'job':'manager'},
    {'name':'Hope','age':25,'job':'analyst'},
    {'name':'Serena','age':23,'job':'doctor'},
    {'name':'Ryan','age':24,'job':'teacher'}
]
df = pd.DataFrame(friend_dict_list)

In [18]:
df = pd.DataFrame(friend_dict_list)

In [19]:
df

     name  age      job
0    John   30  manager
1    Hope   25  analyst
2  Serena   23   doctor
3    Ryan   24  teacher

In [ ]:
# sometimes the order of columns are random so we need

In [20]:
from collections import OrderedDict

In [21]:
friend_orderd_dict = OrderedDict(
    [
      ('name',['John','Nate']),
      ('age',[25,30]),
      ('job', ['student','teacher'])
    ]
)
odr = pd.DataFrame(friend_orderd_dict)

In [22]:
odr = pd.DataFrame(friend_orderd_dict)

In [23]:
odr

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [24]:
friend_list = [
  ['John',20,'student'], 
  ['Nate',30,'teacher']
]

In [25]:
column_name = ['name','age','job']

In [26]:
fra = pd.DataFrame.from_records(friend_list, columns = column_name)

In [27]:
fra

   name  age      job
0  John   20  student
1  Nate   30  teacher

# HOW to save dataframe as file

In [28]:
df.head()

     name  age      job
0    John   30  manager
1    Hope   25  analyst
2  Serena   23   doctor
3    Ryan   24  teacher

In [29]:
new_row = {'name':'Jenny','age':20,'job':None}
df= df.append(new_row,ignore_index=True)
df

     name  age      job
0    John   30  manager
1    Hope   25  analyst
2  Serena   23   doctor
3    Ryan   24  teacher
4   Jenny   20     None

In [30]:
df.to_csv('friends.csv', index=True, header=True)

In [ ]:
df.to_csv('friends.csv', index=True, header=True, na_rep='-')
# na_rep replaces  None value as '-'

In [31]:
df

     name  age      job
0    John   30  manager
1    Hope   25  analyst
2  Serena   23   doctor
3    Ryan   24  teacher
4   Jenny   20     None

In [32]:
df[:3]

     name  age      job
0    John   30  manager
1    Hope   25  analyst
2  Serena   23   doctor

In [33]:
df

     name  age      job
0    John   30  manager
1    Hope   25  analyst
2  Serena   23   doctor
3    Ryan   24  teacher
4   Jenny   20     None

In [ ]:
# how to extract rows that are not continous
df.loc[[0,3]]

   name  age      job
0  John   30  manager
3  Ryan   24  teacher

In [ ]:
#condition - column , kind of like db queries
df [df.age>25]

   name  age      job
0  John   30  manager

In [ ]:
df.query('age>25')

   name  age      job
0  John   30  manager

In [ ]:
df[(df.age>22) &(df.name=='Ryan')]

   name  age      job
3  Ryan   24  teacher

In [ ]:
df

     name  age      job
0    John   30  manager
1    Hope   25  analyst
2  Serena   23   doctor
3    Ryan   24  teacher
4   Jenny   20     None

In [ ]:
df.iloc[:,1:] #locating using indexes - format: [row,col_index]

   age      job
0   30  manager
1   25  analyst
2   23   doctor
3   24  teacher
4   20     None

In [ ]:
# filter by column name
cur= pd.read_csv('https://cdn.wsform.com/wp-content/uploads/2020/09/currency.csv')
cur

    Code Symbol                 Name
0    AFN     Af  Afghanistan Afghani
1    ALL    Lek          Albania Lek
2    ARS      $       Argentina Peso
3    AWG      ƒ        Aruba Guilder
4    AUD      $     Australia Dollar
..   ...    ...                  ...
109  UZS     лв       Uzbekistan Som
110  VEF     Bs    Venezuela Bolivar
111  VND      ₫        Viet Nam Dong
112  YER      ﷼           Yemen Rial
113  ZWD    NaN      Zimbabwe Dollar

[114 rows x 3 columns]

In [ ]:
cur_filtered = cur[['Code','Name']]
cur_filtered

    Code                 Name
0    AFN  Afghanistan Afghani
1    ALL          Albania Lek
2    ARS       Argentina Peso
3    AWG        Aruba Guilder
4    AUD     Australia Dollar
..   ...                  ...
109  UZS       Uzbekistan Som
110  VEF    Venezuela Bolivar
111  VND        Viet Nam Dong
112  YER           Yemen Rial
113  ZWD      Zimbabwe Dollar

[114 rows x 2 columns]

In [ ]:
# filter function
cur.filter(items =['Code','Name'])

    Code                 Name
0    AFN  Afghanistan Afghani
1    ALL          Albania Lek
2    ARS       Argentina Peso
3    AWG        Aruba Guilder
4    AUD     Australia Dollar
..   ...                  ...
109  UZS       Uzbekistan Som
110  VEF    Venezuela Bolivar
111  VND        Viet Nam Dong
112  YER           Yemen Rial
113  ZWD      Zimbabwe Dollar

[114 rows x 2 columns]

In [ ]:
cur.filter(like='a',axis=1) # column that contains letter a

                    Name
0    Afghanistan Afghani
1            Albania Lek
2         Argentina Peso
3          Aruba Guilder
4       Australia Dollar
..                   ...
109       Uzbekistan Som
110    Venezuela Bolivar
111        Viet Nam Dong
112           Yemen Rial
113      Zimbabwe Dollar

[114 rows x 1 columns]

In [ ]:
df.filter(regex='e$',axis=1) # column that end with e

     name  age
0    John   30
1    Hope   25
2  Serena   23
3    Ryan   24
4   Jenny   20

In [ ]:
df.filter(regex='b$',axis=1) # column that end with b

       job
0  manager
1  analyst
2   doctor
3  teacher
4     None

In [ ]:
# Adding + deleting columns / rows 
df

     name  age      job
0    John   30  manager
1    Hope   25  analyst
2  Serena   23   doctor
3    Ryan   24  teacher
4   Jenny   20     None

In [ ]:
df.drop([0]) # put index in [] , but does not alter df

     name  age      job
1    Hope   25  analyst
2  Serena   23   doctor
3    Ryan   24  teacher
4   Jenny   20     None

In [ ]:
df.drop([0], inplace=True) 
# alter df

KeyError: ignored

In [ ]:
df

     name  age      job
1    Hope   25  analyst
2  Serena   23   doctor
3    Ryan   24  teacher
4   Jenny   20     None

In [ ]:
new_row = {'name':'John','age':13,'job':None}
df= df.append(new_row,ignore_index=True)

In [ ]:
new_row2 = {'name':'Josh','age':23,'job':'developer'}
df= df.append(new_row2,ignore_index=True)

In [ ]:
df

     name  age        job
0  Serena   23     doctor
1   Jenny   20       None
2    Josh   23  developer
3    John   13       None

In [ ]:
df = df.drop(df.index[[0,2]]) # drop 0,2 index

In [ ]:
df

    name  age   job
1  Jenny   20  None
3   John   13  None

In [ ]:
new_row2 = {'name':'Josh','age':23,'job':'developer'}
df= df.append(new_row2,ignore_index=True)
df

    name  age        job
0  Jenny   20       None
1   John   13       None
2   Josh   23  developer
3   Josh   23  developer

In [ ]:
df = df[df.age>20]
df

   name  age        job
2  Josh   23  developer
3  Josh   23  developer

In [ ]:
df = df.drop('age',axis=1)  # drop column
df

   name        job
2  Josh  developer
3  Josh  developer

In [ ]:
df

     name  age      job
0    John   30  manager
1    Hope   25  analyst
2  Serena   23   doctor
3    Ryan   24  teacher

In [ ]:
# Creating new cols, rows + updating

In [ ]:
# add salary column
df['salary'] = 0 
df

     name  age      job  salary
0    John   30  manager       0
1    Hope   25  analyst       0
2  Serena   23   doctor       0
3    Ryan   24  teacher       0

In [ ]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student', 'yes','no')
df

     name  age      job salary
0    John   30  manager    yes
1    Hope   25  analyst    yes
2  Serena   23   doctor    yes
3    Ryan   24  teacher    yes

In [34]:
friend_dict_list = [
    {'name':'John','age':30,'gpa':3.3,'award':1,'job':'manager'},
    {'name':'Hope','age':25,'gpa':3.5,'award':2,'job':'analyst'},
    {'name':'Serena','age':23,'gpa':3.9,'award':0,'job':'doctor'},
    {'name':'Ryan','age':24,'gpa':3.2,'award':1,'job':'teacher'},
     {'name':'Judy','age':20,'gpa':2.2,'award':3,'job':'student'}
]
df = pd.DataFrame(friend_dict_list)

In [35]:
df.head()

     name  age  gpa  award      job
0    John   30  3.3      1  manager
1    Hope   25  3.5      2  analyst
2  Serena   23  3.9      0   doctor
3    Ryan   24  3.2      1  teacher
4    Judy   20  2.2      3  student

In [38]:
df['average'] =df['gpa']/2

In [39]:
df.head()

     name  age  gpa  award      job  average
0    John   30  3.3      1  manager     1.65
1    Hope   25  3.5      2  analyst     1.75
2  Serena   23  3.9      0   doctor     1.95
3    Ryan   24  3.2      1  teacher     1.60
4    Judy   20  2.2      3  student     1.10

In [40]:
grades = [ ]
for row in df['average']:
  if row >1.5:
    grades.append('P')
  else:
    grades.append('F')
  
df['grade'] = grades

In [41]:
df.head()

     name  age  gpa  award      job  average grade
0    John   30  3.3      1  manager     1.65     P
1    Hope   25  3.5      2  analyst     1.75     P
2  Serena   23  3.9      0   doctor     1.95     P
3    Ryan   24  3.2      1  teacher     1.60     P
4    Judy   20  2.2      3  student     1.10     F

In [45]:

cert = [ ]
for row in df['award']:
  if row >2:
    cert.append('Certificate')
  else:
    cert.append('NO Certificate')
  
df['certificate'] = cert

In [46]:
df.head()

     name  age  gpa  award      job  average grade     certificate
0    John   30  3.3      1  manager     1.65     P  NO Certificate
1    Hope   25  3.5      2  analyst     1.75     P  NO Certificate
2  Serena   23  3.9      0   doctor     1.95     P  NO Certificate
3    Ryan   24  3.2      1  teacher     1.60     P  NO Certificate
4    Judy   20  2.2      3  student     1.10     F     Certificate

In [48]:
date_list = [
    {
        'yyyy-mm-dd':'2000-06-27'
    },
    {
        'yyyy-mm-dd':'2007-10-27'
    }
]
df = pd.DataFrame(date_list, columns= ['yyyy-mm-dd'])

In [49]:
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [50]:
def extract_year(row):
  return row.split('-')[0]

In [51]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year )

In [52]:
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [53]:
friend_dict_list = [
    {'name':'John','age':30,'gpa':3.3,'award':1,'job':'manager'},
    {'name':'Hope','age':25,'gpa':3.5,'award':2,'job':'analyst'},
    {'name':'Serena','age':23,'gpa':3.9,'award':0,'job':'doctor'},
    {'name':'Ryan','age':24,'gpa':3.2,'award':1,'job':'teacher'},
     {'name':'Judy','age':20,'gpa':2.2,'award':3,'job':'student'}
]
df = pd.DataFrame(friend_dict_list)

In [56]:
df2= pd.DataFrame ([
                    ['Ben',4.0,10]

], columns= ['name','gpa','award'])
df2.head()

  name  gpa  award
0  Ben  4.0     10

In [57]:
df.append(df2,ignore_index=True)

     name   age  gpa  award      job
0    John  30.0  3.3      1  manager
1    Hope  25.0  3.5      2  analyst
2  Serena  23.0  3.9      0   doctor
3    Ryan  24.0  3.2      1  teacher
4    Judy  20.0  2.2      3  student
5     Ben   NaN  4.0     10      NaN

In [144]:
df = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/biostats.csv',header=None, names=['Name','Sex','Age','Height','Weight'],skiprows=[0])

In [61]:
df

    Name         Sex  Age  Height  Weight
0   Alex         "M"   41      74     170
1   Bert         "M"   42      68     166
2   Carl         "M"   32      70     155
3   Dave         "M"   39      72     167
4   Elly         "F"   30      66     124
5   Fran         "F"   33      66     115
6   Gwen         "F"   26      64     121
7   Hank         "M"   30      71     158
8   Ivan         "M"   53      72     175
9   Jake         "M"   32      69     143
10  Kate         "F"   47      69     139
11  Luke         "M"   34      72     163
12  Myra         "F"   23      62      98
13  Neil         "M"   36      75     160
14  Omar         "M"   38      70     145
15  Page         "F"   31      67     135
16  Quin         "M"   29      71     176
17  Ruth         "F"   28      65     131

In [69]:
groupby_sex = df.groupby('Sex')

In [71]:
groupby_sex.groups

{'       "F"': [4, 5, 6, 10, 12, 15, 17], '       "M"': [0, 1, 2, 3, 7, 8, 9, 11, 13, 14, 16]}

In [72]:
for name, group in groupby_sex:
  print (name+ " : " + str(len(group)))
  print(group)
  print()

       "F" : 7
    Name         Sex  Age  Height  Weight
4   Elly         "F"   30      66     124
5   Fran         "F"   33      66     115
6   Gwen         "F"   26      64     121
10  Kate         "F"   47      69     139
12  Myra         "F"   23      62      98
15  Page         "F"   31      67     135
17  Ruth         "F"   28      65     131

       "M" : 11
    Name         Sex  Age  Height  Weight
0   Alex         "M"   41      74     170
1   Bert         "M"   42      68     166
2   Carl         "M"   32      70     155
3   Dave         "M"   39      72     167
7   Hank         "M"   30      71     158
8   Ivan         "M"   53      72     175
9   Jake         "M"   32      69     143
11  Luke         "M"   34      72     163
13  Neil         "M"   36      75     160
14  Omar         "M"   38      70     145
16  Quin         "M"   29      71     176

In [75]:
df_sex_cnt = pd.DataFrame ({'count': groupby_sex.size()})
df_sex_cnt

            count
Sex
       "F"      7
       "M"     11

In [113]:
# delete duplicates
friend_orderd_dict = OrderedDict(
    [
      ('name',['John','Nate']),
      ('age',[25,30]),
      ('job', ['student','teacher'])
    ]
)
odr = pd.DataFrame(friend_orderd_dict)

In [114]:
one_row={'name':'John','age':25,'job':'student'}

odr = odr.append(one_row,ignore_index=True)

In [115]:
odr.duplicated()

0    False
1    False
2     True
dtype: bool

In [116]:
new_row={'name':'John','age':30,'job':'analyst'}

odr = odr.append(new_row,ignore_index=True)

In [108]:
odr.drop_duplicates()

0     True
1    False
dtype: bool

In [117]:
odr

   name  age      job
0  John   25  student
1  Nate   30  teacher
2  John   25  student
3  John   30  analyst

In [119]:
odr.drop_duplicates(['name'],keep='first')

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
# Replacing non values to another thing

In [145]:
new_row=[{'Name':'John','Sex':'M','Age':None,'Height':None,'Weight':None}
         ,{'Name':'Heewon','Sex':'F','Age':None,'Height':None,'Weight':None}]

df = df.append(new_row,ignore_index=True)

In [146]:
df

      Name         Sex   Age Height Weight
0     Alex         "M"    41     74    170
1     Bert         "M"    42     68    166
2     Carl         "M"    32     70    155
3     Dave         "M"    39     72    167
4     Elly         "F"    30     66    124
5     Fran         "F"    33     66    115
6     Gwen         "F"    26     64    121
7     Hank         "M"    30     71    158
8     Ivan         "M"    53     72    175
9     Jake         "M"    32     69    143
10    Kate         "F"    47     69    139
11    Luke         "M"    34     72    163
12    Myra         "F"    23     62     98
13    Neil         "M"    36     75    160
14    Omar         "M"    38     70    145
15    Page         "F"    31     67    135
16    Quin         "M"    29     71    176
17    Ruth         "F"    28     65    131
18    John           M  None   None   None
19  Heewon           F  None   None   None

In [147]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    20 non-null     object
 1   Sex     20 non-null     object
 2   Age     18 non-null     object
 3   Height  18 non-null     object
 4   Weight  18 non-null     object
dtypes: object(5)
memory usage: 928.0+ bytes

In [125]:
df.shape

(20, 5)

In [126]:
df.isna() # is null

     Name    Sex    Age  Height  Weight
0   False  False  False   False   False
1   False  False  False   False   False
2   False  False  False   False   False
3   False  False  False   False   False
4   False  False  False   False   False
5   False  False  False   False   False
6   False  False  False   False   False
7   False  False  False   False   False
8   False  False  False   False   False
9   False  False  False   False   False
10  False  False  False   False   False
11  False  False  False   False   False
12  False  False  False   False   False
13  False  False  False   False   False
14  False  False  False   False   False
15  False  False  False   False   False
16  False  False  False   False   False
17  False  False  False   False   False
18  False  False   True    True    True
19  False  False   True    True    True

In [127]:
df.isnull()

     Name    Sex    Age  Height  Weight
0   False  False  False   False   False
1   False  False  False   False   False
2   False  False  False   False   False
3   False  False  False   False   False
4   False  False  False   False   False
5   False  False  False   False   False
6   False  False  False   False   False
7   False  False  False   False   False
8   False  False  False   False   False
9   False  False  False   False   False
10  False  False  False   False   False
11  False  False  False   False   False
12  False  False  False   False   False
13  False  False  False   False   False
14  False  False  False   False   False
15  False  False  False   False   False
16  False  False  False   False   False
17  False  False  False   False   False
18  False  False   True    True    True
19  False  False   True    True    True

In [148]:
df.Age = df.Age.fillna(0)

In [130]:
df

      Name         Sex  Age Height Weight
0     Alex         "M"   41     74    170
1     Bert         "M"   42     68    166
2     Carl         "M"   32     70    155
3     Dave         "M"   39     72    167
4     Elly         "F"   30     66    124
5     Fran         "F"   33     66    115
6     Gwen         "F"   26     64    121
7     Hank         "M"   30     71    158
8     Ivan         "M"   53     72    175
9     Jake         "M"   32     69    143
10    Kate         "F"   47     69    139
11    Luke         "M"   34     72    163
12    Myra         "F"   23     62     98
13    Neil         "M"   36     75    160
14    Omar         "M"   38     70    145
15    Page         "F"   31     67    135
16    Quin         "M"   29     71    176
17    Ruth         "F"   28     65    131
18    John           M    0   None   None
19  Heewon           F    0   None   None

In [149]:
df['Age'].fillna(df.groupby('Sex')['Age'].transform('median'),inplace = True)

In [150]:
df

      Name         Sex  Age Height Weight
0     Alex         "M"   41     74    170
1     Bert         "M"   42     68    166
2     Carl         "M"   32     70    155
3     Dave         "M"   39     72    167
4     Elly         "F"   30     66    124
5     Fran         "F"   33     66    115
6     Gwen         "F"   26     64    121
7     Hank         "M"   30     71    158
8     Ivan         "M"   53     72    175
9     Jake         "M"   32     69    143
10    Kate         "F"   47     69    139
11    Luke         "M"   34     72    163
12    Myra         "F"   23     62     98
13    Neil         "M"   36     75    160
14    Omar         "M"   38     70    145
15    Page         "F"   31     67    135
16    Quin         "M"   29     71    176
17    Ruth         "F"   28     65    131
18    John           M    0   None   None
19  Heewon           F    0   None   None

In [154]:
# Apply function
date_list = [
    {
        'yyyy-mm-dd':'2000-06-27'
    },
    {
        'yyyy-mm-dd':'2007-10-27'
    },
    {
        'yyyy-mm-dd':'2005-08-20'
    },
    {
        'yyyy-mm-dd':'1997-02-18'
    }
]
df = pd.DataFrame(date_list, columns= ['yyyy-mm-dd'])

In [155]:
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27
2  2005-08-20
3  1997-02-18

In [156]:
def extract_month ( column):
  return column.split('-')[1]

In [159]:
df ['year']= df['yyyy-mm-dd'].apply(extract_year)
df ['month']=df['yyyy-mm-dd'].apply(extract_month)

In [160]:
df

   yyyy-mm-dd  year month
0  2000-06-27  2000    06
1  2007-10-27  2007    10
2  2005-08-20  2005    08
3  1997-02-18  1997    02

In [161]:
def get_age(year,current_year):
  return current_year -int( year)

In [164]:
df['age'] = df['year'].apply(get_age,current_year = 2020)

In [165]:
df

   yyyy-mm-dd  year month  age
0  2000-06-27  2000    06   20
1  2007-10-27  2007    10   13
2  2005-08-20  2005    08   15
3  1997-02-18  1997    02   23

In [166]:
def get_introduction (age, prefix, suffix):
  return prefix + str(age) + suffix

In [177]:
df['introduction']=df['age'].apply(get_introduction, prefix="I am ", suffix=" year's old")

In [173]:
df

   yyyy-mm-dd  year month  age        introduction
0  2000-06-27  2000    06   20  I am 20 year's old
1  2007-10-27  2007    10   13  I am 13 year's old
2  2005-08-20  2005    08   15  I am 15 year's old
3  1997-02-18  1997    02   23  I am 23 year's old

In [178]:
def get_introduction2 (row):
  return "I was born in " + str (row.year)+" my age is "+str(row.age)

In [179]:
df['introduction2'] = df.apply(get_introduction2, axis=1)

In [182]:
df

   yyyy-mm-dd  year  ...        introduction                    introduction2
0  2000-06-27  2000  ...  I am 20 year's old  I was born in 2000 my age is 20
1  2007-10-27  2007  ...  I am 13 year's old  I was born in 2007 my age is 13
2  2005-08-20  2005  ...  I am 15 year's old  I was born in 2005 my age is 15
3  1997-02-18  1997  ...  I am 23 year's old  I was born in 1997 my age is 23

[4 rows x 6 columns]

In [186]:
# MAP, APPLY MAP 
# Apply function
date_list = [
    {
        'date':'2000-06-27'
    },
    {
        'date':'2007-10-27'
    },
    {
        'date':'2005-08-20'
    },
    {
        'date':'1997-02-18'
    }
]
df = pd.DataFrame(date_list, columns= ['date'])

In [187]:
df

         date
0  2000-06-27
1  2007-10-27
2  2005-08-20
3  1997-02-18

In [189]:
df['year']=df['date'].map(extract_year)
df

         date  year
0  2000-06-27  2000
1  2007-10-27  2007
2  2005-08-20  2005
3  1997-02-18  1997

In [192]:
job_list = [{'age':20,'job':'student'}, 
            {'age':30,'job':'developer'}, 
            {'age':25,'job':'teacher'}
            ]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   25    teacher

In [197]:
df.job = df.job.map({"student":1, "developer":2,"teacher":3})

In [198]:
df

   age  job
0   20  NaN
1   30  NaN
2   25  NaN

In [199]:
x_y = [
       {'x':5.5,'y':-5.6,'z':-1.1},
       {'x':-5.2,'y':5.5,'z':-2.2},
       {'x':-1.6,'y':-4.5,'z':-3.3}
]
df = pd.DataFrame(x_y)

In [200]:
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [203]:
import numpy as np
df = df.applymap(np.around) # apply map when you want to apply to every cols
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

In [204]:
job_list = [{'name':'Noah','age':20,'job':'student'}, 
            {'name':'Joe','age':30,'job':'developer'}, 
            {'name':'Kile','age':25,'job':'teacher'}, 
            {'name':'Kate','age':22,'job':'engineer'}, 
            {'name':'Josh','age':25,'job':'teacher'}, 
            {'name':'Hope','age':25,'job':'teacher'},
            {'name':'Heewon','age':24,'job':'developer'}, 
            {'name':'John','age':23,'job':'developer'},
            {'name':'Dahm','age':22,'job':'docter'}
            ]
df = pd.DataFrame(job_list)
df

     name  age        job
0    Noah   20    student
1     Joe   30  developer
2    Kile   25    teacher
3    Kate   22   engineer
4    Josh   25    teacher
5    Hope   25    teacher
6  Heewon   24  developer
7    John   23  developer
8    Dahm   22     docter

In [206]:
df.job.unique

<bound method Series.unique of 0      student
1    developer
2      teacher
3     engineer
4      teacher
5      teacher
6    developer
7    developer
8       docter
Name: job, dtype: object>

In [208]:
df.job.value_counts()

teacher      3
developer    3
student      1
engineer     1
docter       1
Name: job, dtype: int64

In [209]:
# concatenating/adding two data frames
job_list = [ 
            {'name':'Hope','age':25,'job':'teacher'},
            {'name':'Heewon','age':24,'job':'developer'}, 
            {'name':'John','age':23,'job':'developer'},
            {'name':'Dahm','age':22,'job':'docter'}
            ]
df1 = pd.DataFrame(job_list)
job_list2 = [{'name':'Noah','age':20,'job':'student'}, 
            {'name':'Joe','age':30,'job':'developer'}, 
            {'name':'Kile','age':25,'job':'teacher'}, 
            {'name':'Kate','age':22,'job':'engineer'}, 
            {'name':'Josh','age':25,'job':'teacher'}
            ]
df2 = pd.DataFrame(job_list2)

In [210]:
df1

     name  age        job
0    Hope   25    teacher
1  Heewon   24  developer
2    John   23  developer
3    Dahm   22     docter

In [211]:
df2

   name  age        job
0  Noah   20    student
1   Joe   30  developer
2  Kile   25    teacher
3  Kate   22   engineer
4  Josh   25    teacher

In [213]:
result = pd.concat([df1,df2]) #without index change 
result

     name  age        job
0    Hope   25    teacher
1  Heewon   24  developer
2    John   23  developer
3    Dahm   22     docter
0    Noah   20    student
1     Joe   30  developer
2    Kile   25    teacher
3    Kate   22   engineer
4    Josh   25    teacher

In [214]:
result = pd.concat([df1,df2], ignore_index=True)
result

     name  age        job
0    Hope   25    teacher
1  Heewon   24  developer
2    John   23  developer
3    Dahm   22     docter
4    Noah   20    student
5     Joe   30  developer
6    Kile   25    teacher
7    Kate   22   engineer
8    Josh   25    teacher

In [217]:
result = df1.append(df2)
result

     name  age        job
0    Hope   25    teacher
1  Heewon   24  developer
2    John   23  developer
3    Dahm   22     docter
0    Noah   20    student
1     Joe   30  developer
2    Kile   25    teacher
3    Kate   22   engineer
4    Josh   25    teacher

In [218]:
result = df1.append(df2, ignore_index=True)
result

     name  age        job
0    Hope   25    teacher
1  Heewon   24  developer
2    John   23  developer
3    Dahm   22     docter
4    Noah   20    student
5     Joe   30  developer
6    Kile   25    teacher
7    Kate   22   engineer
8    Josh   25    teacher

In [220]:
# Adding as cols! 
l1 = [ 
            {'name':'Hope','age':25,'job':'teacher'},
            {'name':'Heewon','age':24,'job':'developer'}, 
            {'name':'John','age':23,'job':'developer'}
]
l2 =  [{'name':'Noah','age':20,'job':'student'}, 
        {'name':'Joe','age':30,'job':'developer'}, 
        {'name':'Kile','age':25,'job':'teacher'} 
            ]
l3 = [
      {'name':'Josh','age':25,'job':'teacher'},
       {'name':'Dahm','age':22,'job':'docter'},
      {'name':'Kate','age':22,'job':'engineer'}
]
l4 = [
      {'salary':5000, 'country':'Korea'},
      {'salary':7000, 'country':'U.S'},
      {'salary':4000, 'country':'China'}
]

In [225]:
df1= pd.DataFrame ( l3, columns = ['name','job'])
df2= pd.DataFrame ( l4, columns = ['salary','country'])

In [226]:
df1

   name       job
0  Josh   teacher
1  Dahm    docter
2  Kate  engineer

In [227]:
df2

   salary country
0    5000   Korea
1    7000     U.S
2    4000   China

In [232]:
result = pd.concat([df1,df2], axis =1, ignore_index=True)
result

      0         1     2      3
0  Josh   teacher  5000  Korea
1  Dahm    docter  7000    U.S
2  Kate  engineer  4000  China

In [234]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [236]:
comparison = pd.DataFrame ( {'label':label, 'prediction':prediction})

In [237]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4